Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: The :func:`find\*` routines might look a bit funny at first sight. They are primarily meant to do echo cancellation. A reasonably fast way to do this is to pick the most energetic piece of the output sample, locate that in the input sample and subtract the whole output sample from the input sample::
pl: Zadania :func:`find\*` mogą wyglądać trochę śmiesznie na pierwszy rzut oka. Są one pomyślane w pierwszej kolejności aby wykonywać anulowanie echa. Rozsądnie szybką drogą aby tego dokonać jest wybrać najbardziej energetyczny kawałek wyjściowych próbek, znaleźć to w próbkach wejściowych i odjąć całą wyjściową próbkę od próbki wejściowej::

source: def echocancel(outputdata, inputdata): pos = audioop.findmax(outputdata, 800) # one tenth second out_test = outputdata[pos*2:] in_test = inputdata[pos*2:] ipos, factor = audioop.findfit(in_test, out_test) # Optional (for better cancellation): # factor = audioop.findfactor(in_test[ipos*2:ipos*2+len(out_test)], # out_test) prefill = '\0'*(pos+ipos)*2 postfill = '\0'*(len(inputdata)-len(prefill)-len(outputdata)) outputdata = prefill + audioop.mul(outputdata,2,-factor) + postfill return audioop.add(inputdata, outputdata, 2)
pl: def echocancel(outputdata, inputdata): pos = audioop.findmax(outputdata, 800) # jedna dziesiąta sekundy out_test = outputdata[pos*2:] in_test = inputdata[pos*2:] ipos, factor = audioop.findfit(in_test, out_test) # Optional (dla lepszego anulowania): # factor = audioop.findfactor(in_test[ipos*2:ipos*2+len(out_test)], # out_test) prefill = '\0'*(pos+ipos)*2 postfill = '\0'*(len(inputdata)-len(prefill)-len(outputdata)) outputdata = prefill + audioop.mul(outputdata,2,-factor) + postfill return audioop.add(inputdata, outputdata, 2)

source: :mod:`base64` --- RFC 3548: Base16, Base32, Base64 Data Encodings
pl: moduł :mod:`base64` --- RFC 3548: kodowania danych Base16 Base32, Base64

source: This module provides data encoding and decoding as specified in :rfc:`3548`. This standard defines the Base16, Base32, and Base64 algorithms for encoding and decoding arbitrary binary strings into text strings that can be safely sent by email, used as parts of URLs, or included as part of an HTTP POST request. The encoding algorithm is not the same as the :program:`uuencode` program.
pl: Ten moduł dostarcza kodowanie i dekodowanie jak określono w :rfc:`3548` Ten standard definiuje algorytmy kodowania i dekodowania Base16, Base32, Base64 danych binarnych ciągów na tekstowe ciągi znaków które mogą być bezpiecznie przesyłane przez email, użyte jako część adresu URL lub załączone jako część zapytania HTTP POST. Algorytm kodowania nie jest ten sam, jak program :program:`uuencode`.

source: There are two interfaces provided by this module. The modern interface supports encoding and decoding string objects using all three alphabets. The legacy interface provides for encoding and decoding to and from file-like objects as well as strings, but only using the Base64 standard alphabet.
pl: Istnieją dwa sprzęgi dostarczane przez ten moduł. Współczesny sprzęg wspiera kodowanie i dekodowanie przedmiotów ciągów przy użyciu wszystkich trzech alfabetów. Ubiegłe sprzęgi dostarczają kodowania i dekodowania do i z pliko-podobnych przedmiotów zarówno jak ciągów znaków, ale tylko przy użyciu standardowego alfabetu Base64.

source: The modern interface provides:
pl: Nowy sprzęg dostarcza:

source: Encode a string use Base64.
pl: Zakoduj ciąg znaków używając Base64.

source: *s* is the string to encode. Optional *altchars* must be a string of at least length 2 (additional characters are ignored) which specifies an alternative alphabet for the ``+`` and ``/`` characters. This allows an application to e.g. generate URL or filesystem safe Base64 strings. The default is ``None``, for which the standard Base64 alphabet is used.
pl: *s* jest ciągiem znaków do zakodowania. Opcjonalne *altchars* alternatywne znaki muszą być ciągiem o długości co najmniej 2 znaków (dodatkowe znaki są ignorowane) co określa alternatywny alfabet dla znaków ``+`` i ``/``. To pozwala aplikacji na przykład do generowania adresów URL lub bezpiecznych dla systemu plików ciągów znaków Base64. Domyślne jest ``None``, dla którego standardowy alfabet Base64 jest używany.

source: The encoded string is returned.
pl: Zakodowany ciąg znaków jest zwracany.

source: Decode a Base64 encoded string.
pl: Zdekoduj zakodowany ciąg znaków.

source: *s* is the string to decode. Optional *altchars* must be a string of at least length 2 (additional characters are ignored) which specifies the alternative alphabet used instead of the ``+`` and ``/`` characters.
pl: *s* jest ciągiem do zdekodowania. Opcjonalne *altchars* muszą być ciągiem o długości co najmniej 2 znaków (dodatkowe znaki są ignorowane) które określają alternatywny alfabet używany zamiast znaków ``+`` i ``/``.

source: The decoded string is returned. A :exc:`TypeError` is raised if *s* were incorrectly padded or if there are non-alphabet characters present in the string.
pl: Zdekodowany ciąg znaków jest zwracany. Wyjątek :exc:`TypeError` jest zgłaszany jeśli *s* zostały niewłaściwie uzupełnione lub jeśli są nie-alfabetyczne znaki obecne w ciągu znaków.

source: Encode string *s* using the standard Base64 alphabet.
pl: Zakoduj ciąg *s* używając standardowego alfabetu Base64.

source: Decode string *s* using the standard Base64 alphabet.
pl: Zdekoduj ciąg znaków *s* używając standardowego alfabetu Base64.

source: Encode string *s* using a URL-safe alphabet, which substitutes ``-`` instead of ``+`` and ``_`` instead of ``/`` in the standard Base64 alphabet. The result can still contain ``=``.
pl: Zakoduj ciąg znaków *s* używając bezpieczny dla adresów URL alfabet, który zamienia ``-`` zamiast ``+`` i ``_`` zamiast ``/`` w standardowym alfabecie Base64. Wynik może wciąż zawierać znak ``=``.

source: Decode string *s* using a URL-safe alphabet, which substitutes ``-`` instead of ``+`` and ``_`` instead of ``/`` in the standard Base64 alphabet.
pl: Zdekoduj ciąg znaków *s* używając alfabetu bezpiecznego dla adresów URL który zamienia ``-`` na ``+`` i ``_`` zamiast ``/`` w standardowym alfabecie Base64.

source: Encode a string using Base32. *s* is the string to encode. The encoded string is returned.
pl: Zakoduj ciąg znaków używając Base32. *s* jest ciągiem do zakodowania. Zakodowany ciąg znaków jest zwracany.

source: Decode a Base32 encoded string.
pl: Zdekoduj ciąg znaków zakodowany używając kodowania Base32.

source: *s* is the string to decode. Optional *casefold* is a flag specifying whether a lowercase alphabet is acceptable as input. For security purposes, the default is ``False``.
pl: *s* jest ciągiem znaków do zdekodowania. Opcjonalna *casefold* jest flagą określającą czy alfabet małych liter jest akceptowalny jako wejście. Ze względów bezpieczeństwa, domyślnie jest to ``Fałsz`` - z ang. - ``False``.

source: :rfc:`3548` allows for optional mapping of the digit 0 (zero) to the letter O (oh), and for optional mapping of the digit 1 (one) to either the letter I (eye) or letter L (el). The optional argument *map01* when not ``None``, specifies which letter the digit 1 should be mapped to (when *map01* is not ``None``, the digit 0 is always mapped to the letter O). For security purposes the default is ``None``, so that 0 and 1 are not allowed in the input.
pl: :rfc:`3548` zezwala na dodatkowe mapowanie cyfry 0 (zero) do litery O (o), i opcjonalne mapowanie cyfry 1 (jeden) albo do litery I (i) lub litery L (el). Opcjonalny parametr *map01* jeśli nie ``Żaden`` - z ang. - ``None``, określa do których liter cyfra 1 powinna być zmapowana (gdy *map01* nie jest ``None``, cyfra 0 jest zawsze mapowana do litery O). Ze względów bezpieczeństwa domyślnie jest to ``Żaden`` - z ang. - ``None``, więc 0 i 1 nie są pozwalane w ciągu wejściowym.

source: Encode a string using Base16.
pl: Zakoduj ciąg znaków używając Base16.

source: *s* is the string to encode. The encoded string is returned.
pl: *s* jest ciągiem znaków do zakodowania. Zakodowany ciąg znaków jest zwracany.

source: Decode a Base16 encoded string.
pl: Zdekoduj ciąg znaków zakodowany za pomocą Base16.

source: The legacy interface:
pl: Przestarzały sprzęg:

source: Decode the contents of the binary *input* file and write the resulting binary data to the *output* file. *input* and *output* must either be file objects or objects that mimic the file object interface working with bytes objects. *input* will be read until ``input.read()`` returns an empty string.
pl: Zdekoduj zawartość binarnego pliku *wejściowego* i zapisz wynikowe dane binarne do pliku *wyjściowego*. *input* - z ang. - *wejściowy* i *output* - z ang. - *wyjściowy* muszą być przedmiotami plików lub przedmiotami udającymi sprzęg przedmiotu pliku pracujący z przedmiotem bytes. *input* - z ang. - *wejściowy* będzie wczytywany dopóki ``input.read()`` nie zwróci pustego ciągu znaków.

source: Decode the bytestring *s*, which must contain one or more lines of base64 encoded data, and return a bytestring containing the resulting binary data. ``decodestring`` is a deprecated alias.
pl: Zdekoduje ciąg-bajtów *s*, który musi zawierać jedną lub więcej linię zakodowanych danych w base64, i zwraca ciąg bajtów zawierających wynikowe dane binarne. ``decodestring`` jest przestarzałym synonimem.

source: Encode the contents of the binary *input* file and write the resulting base64 encoded data to the *output* file. *input* and *output* must either be file objects or objects that mimic the file object interface working with bytes objects. *input* will be read until ``input.read()`` returns an empty string. :func:`encode` returns the encoded data plus a trailing newline character (``b'\n'``).
pl: Zakoduj zawartość binarnego pliku *wejściowego* i zapisz wynikające dane zakodowane w base64 do pliku *wyjściowego*. *Wejściowe* - z ang. - *input* i *wyjściowe* - z ang - *output* musi albo być przedmiotem pliku lub przedmiotami które udają sprzęg przedmiotu plikowego pracujący z przedmiotami bajtowymi. *wejściowy* będzie wczytywany dopóki ``input.read()`` nie zwróci pustego ciągu znaków. :func:`encode` zwraca zakodowane dane plus kończący znak nowego wiersza (``b' '``).

source: Encode the bytestring *s*, which can contain arbitrary binary data, and return a bytestring containing one or more lines of base64-encoded data. :func:`encodebytes` returns a string containing one or more lines of base64-encoded data always including an extra trailing newline (``b'\n'``). ``encodestring`` is a deprecated alias.
pl: Zakoduj ciąg bajtów *s*, który może zawierać dowolne binarne dane, i zwracać ciąg bajtów zawierający jedną lub więcej linii danych zakodowanych kodowaniem base64. Zadanie :func:`encodebytes` zwraca ciąg zawierający jedną lub więcej linii zakodowanych danych kodem base64 zawsze zawierający dodatkowy znak nowej linii (``b' '``). ``encodestring`` jest przestarzałym synonimem.

source: An example usage of the module:
pl: Przykładowe użycie modułu:

source: >>> import base64 >>> encoded = base64.b64encode('data to be encoded') >>> encoded b'ZGF0YSB0byBiZSBlbmNvZGVk' >>> data = base64.b64decode(encoded) >>> data 'data to be encoded'
pl: >>> import base64 >>> encoded = base64.b64encode('dane do zakodowania') >>> encoded 'ZGFuZSBkbyB6YWtvZG93YW5pYQ==' >>> data = base64.b64decode(encoded) >>> data 'dane do zakodowania'

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
pl: Wspierający moduł zawierający konwersję ASCII-do-binarnego i binarnego-do-ASCII.

source: Section 5.2, "Base64 Content-Transfer-Encoding," provides the definition of the base64 encoding.
pl: Sekcja 5.2, "Base64 Treść-Transfer-Kodowanie," dostarcza definicji kodowania base64.

source: :mod:`bdb` --- Debugger framework
pl: :mod:`bdb` --- szkielet debugowania

source: The :mod:`bdb` module handles basic debugger functions, like setting breakpoints or managing execution via the debugger.
pl: Moduł :mod:`bdb` obsługuje podstawowe zadania debuggera, jak ustawianie punktów przerywania lub zarządzenie wykonaniem przez debugger.

source: The following exception is defined:
pl: Następujący wyjątek jest zdefiniowany:

source: Exception raised by the :class:`Bdb` class for quitting the debugger.
pl: Wyjątek zgłaszany przez uogólnienie :class:`Bdb` dla wyjścia z odpluskwiania.

source: The :mod:`bdb` module also defines two classes:
pl: Moduł :mod:`bdb` definiuje dwa uogólnienia:

source: This class implements temporary breakpoints, ignore counts, disabling and (re-)enabling, and conditionals.
pl: To uogólnienie wypełnia tymczasowe punkty przerywania, liczniki ignorowania, wyłączanie i (ponowne-)włączanie i warunkowe.

source: Breakpoints are indexed by number through a list called :attr:`bpbynumber` and by ``(file, line)`` pairs through :attr:`bplist`. The former points to a single instance of class :class:`Breakpoint`. The latter points to a list of such instances since there may be more than one breakpoint per line.
pl: Punkty przerywania są numerowane przez liczbę dla listy zwanej :attr:`bpbynumber` i przez pary ``(file, line)`` przez :attr:`bplist`. Poprzednie wskazuje na pojedynczy przykład uogólnienia :class:`Breakpoint` - z ang. - punkt przerywania. Ten drugi wskazuje na listę takich przykładów gdyż może być więcej niż jeden punkt przerywania na linię.

source: When creating a breakpoint, its associated filename should be in canonical form. If a *funcname* is defined, a breakpoint hit will be counted when the first line of that function is executed. A conditional breakpoint always counts a hit.
pl: Gdy tworzony jest punkt przerywania, związana z nim nazwa pliku powinna być w kanonicznej formie. Jeśli nazwa zadania jest określona - z ang. - *funcname*, uderzenie w punkt przerywania będzie się liczyła gdy pierwsza linia tego zadania będzie wykonana. Warunkowy punkt przerywania zawsze liczy się jako uderzenie.

source: :class:`Breakpoint` instances have the following methods:
pl: Przykłady uogólnienia :class:`Breakpoint` mają następujące sposoby postępowania:

source: Delete the breakpoint from the list associated to a file/line. If it is the last breakpoint in that position, it also deletes the entry for the file/line.
pl: Skasuj punkt przerywania wykonania z listy związanej z plikiem/linią. Jeśli jest to ostatni punkt przerywania w tej pozycji, on także kasuje wpis dla pliku/linii.

source: Mark the breakpoint as enabled.
pl: Oznacz punkt przerywania wykonania jako włączony.

source: Mark the breakpoint as disabled.
pl: Oznacz punkt przerywania wykonania jako wyłączony.

source: Print all the information about the breakpoint:
pl: Wydrukuj wszystkie informacje o punkcie przerywania:

source: The breakpoint number.
pl: Numer punktu przerywania

source: If it is temporary or not.
pl: Czy jest tymczasowy czy nie.

source: Its file,line position.
pl: Jego pozycja plik,linia.

source: The condition that causes a break.
pl: Warunek który powoduje przerwanie wykonania.

source: If it must be ignored the next N times.
pl: To czy musi być ignorowany następnych N razy.

source: The breakpoint hit count.
pl: Liczba trafień punktu przerywania.

source: The :class:`Bdb` class acts as a generic Python debugger base class.
pl: Uogólnienie :class:`Bdb` działa jako zastępcze uogólnienie odpluskwiania języka pytonowskiego.

source: This class takes care of the details of the trace facility; a derived class should implement user interaction. The standard debugger class (:class:`pdb.Pdb`) is an example.
pl: To uogólnienie zajmuje się szczegółami urządzenia śledzenia; pochodne uogólnienie powinno wypełniać interakcję z użytkownikiem. Standardowe uogólnienie odpluskwiania (:class:`pdb.Pdb`) jest przykładem.

source: The *skip* argument, if given, must be an iterable of glob-style module name patterns. The debugger will not step into frames that originate in a module that matches one of these patterns. Whether a frame is considered to originate in a certain module is determined by the ``__name__`` in the frame globals.
pl: Parametr *skip*, jeśli dany musi być iterowalnym wzorcem nazwy modułu w stylu-glob. Odpluskwianie nie wejdzie w ramki które zaczynają się w module który pasuje do jednego ze wzorców. To czy ramka jest uznawana za pochodzącą z konkretnego modułu jest określane przez nazwę ``__name__`` w globalnych ramkach.

source: The following methods of :class:`Bdb` normally don't need to be overridden.
pl: Następujące sposoby postępowania uogólnienia :class:`Bdb` zwykle nie potrzebują być przesłaniane.

source: Auxiliary method for getting a filename in a canonical form, that is, as a case-normalized (on case-insensitive filesystems) absolute path, stripped of surrounding angle brackets.
pl: Dodatkowy sposób postępowania dla pobierania nazwy pliku w kanonicznej formie, to jest, jako znormalizowane względem wielkości liter (w systemach plików niewrażliwych na rozmiar liter) bezwzględne ścieżki dostępu okrojone z otaczających ostrych nawiasów.

source: Set the :attr:`botframe`, :attr:`stopframe`, :attr:`returnframe` and :attr:`quitting` attributes with values ready to start debugging.
pl: Ustaw właściwości :attr:`botframe`, :attr:`stopframe`, :attr:`returnframe` i :attr:`quitting` z wartościami gotowymi do rozpoczęcia odpluskwiania.

source: This function is installed as the trace function of debugged frames. Its return value is the new trace function (in most cases, that is, itself).
pl: To zadanie jest instalowane jako zadanie śledzenia odpluskwianych ramek. Jej wartość zwracana jest nowym zadaniem śledzenia (w większości przypadków, to jest, ono samo).

source: The default implementation decides how to dispatch a frame, depending on the type of event (passed as a string) that is about to be executed. *event* can be one of the following:
pl: Domyślne wypełnienie decyduje jak obsłużyć ramkę, w zależności od rodzaju zdarzenia (przekazanego jako ciąg znaków) które właśnie ma być wykonane. *event* może być jednym z następujących:

source: ``"line"``: A new line of code is going to be executed.
pl: ``"line"``: Nowa linia kodu będzie wykonywana.

source: ``"call"``: A function is about to be called, or another code block entered.
pl: ``"call"``: Zadanie będzie za chwilę wywołane, lub nastąpi wkroczenie do następnego bloku kodu.

source: ``"return"``: A function or other code block is about to return.
pl: ``"return"``: Zadanie lub inny blok kodu jest gotowy do powrotu.

source: ``"exception"``: An exception has occurred.
pl: ``"wyjątek"`` - z ang. - ``"exception"``: Wyjątek nastąpił.

source: ``"c_call"``: A C function is about to be called.
pl: ``"c_call"``: Zadanie C będzie wywoływane.

source: ``"c_return"``: A C function has returned.
pl: ``"c_return"``: Zadanie C wykonało powrót.

source: ``"c_exception"``: A C function has thrown an exception.
pl: ``"wyjątek_c"`` - z ang. - ``"c_exception"``: zadanie C wyrzuciło wyjątek.

source: For the Python events, specialized functions (see below) are called. For the C events, no action is taken.
pl: Dla zdarzeń języka pytonowskiego, specjalizowane zadania (zobacz poniżej) są wywoływane. Dla zdarzeń C, żadne działanie nie jest podejmowane.

source: The *arg* parameter depends on the previous event.
pl: Parametr *arg* zależy od poprzedniego zdarzenia.

source: See the documentation for :func:`sys.settrace` for more information on the trace function. For more information on code and frame objects, refer to :ref:`types`.
pl: Zobacz dokumentację dla :func:`sys.settrace` po więcej informacji o zadaniu śledzenia. Po więcej informacji o kodzie i przedmiotach ramek, odwołaj się do :ref:`types`.

source: If the debugger should stop on the current line, invoke the :meth:`user_line` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`Bdb.quitting` flag is set (which can be set from :meth:`user_line`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
pl: Jeśli odpluskwianie powinno zatrzymać się na obecnej linii, wywołaj sposób postępowania :meth:`user_line` (która powinna być przesłonięta w podrzędnych uogólnieniach). Zgłoś wyjątek :exc:`BdbQuit` jeśli flaga :attr:`Bdb.quitting` jest ustawiona (co może zostać ustawione z :meth:`user_line`). Zwróć odniesienie do sposobu postępowania :meth:`trace_dispatch` dla dalszego śledzenia w tym kontekście.

source: If the debugger should stop on this function call, invoke the :meth:`user_call` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`Bdb.quitting` flag is set (which can be set from :meth:`user_call`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
pl: Jeśli odpluskwianie powinno zakończyć się w tym wywołaniu zadania, wywołaj sposób postępowania :meth:`user_call` (co powinno być przesłonięte w podrzędnych uogólnieniach). Zgłoś wyjątek :exc:`BdbQuit` jeśli flaga :attr:`Bdb.quitting` jest ustawiona (co może być ustawione ze sposobu postępowania :meth:`user_call`). Zwróć odniesienie do sposobu postępowania :meth:`trace_dispatch` dla dalszego śledzenia w tym zakresie.

source: If the debugger should stop on this function return, invoke the :meth:`user_return` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`Bdb.quitting` flag is set (which can be set from :meth:`user_return`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
pl: Jeśli odpluskwianie powinno zatrzymać się na tym powrocie z zadania, wywołaj sposób postępowania :meth:`user_return` (która powinna być przesłonięty w podrzędnych uogólnieniach). Zgłasza wyjątek :exc:`BdbQuit` jeśli flaga :attr:`Bdb.quitting` jest ustawiona (co może być ustawione z :meth:`user_return`). Zwróć odniesienie do sposobu postępowania :meth:`trace_dispatch` dla dalszego śledzenia w tym zakresie.

source: If the debugger should stop at this exception, invokes the :meth:`user_exception` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`Bdb.quitting` flag is set (which can be set from :meth:`user_exception`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
pl: Jeśli odpluskwianie powinno zatrzymać się na tym wyjątku, zgłasza sposób postępowania :meth:`user_exception` (który powinien zostać przesłonięty w podrzędnym uogólnieniu). Zgłoś wyjątek :exc:`BdbQuit` jeśli flaga :attr:`Bdb.quitting` jest ustawiona (co może być ustawione ze sposobu postępowania :meth:`user_exception`). Zwróć odniesienie do sposobu postępowania :meth:`trace_dispatch` dla dalszego śledzenia w tym zakresie.

source: Normally derived classes don't override the following methods, but they may if they want to redefine the definition of stopping and breakpoints.
pl: Normalnie dziedziczone uogólnienia nie przesłaniają następujących sposobów postępowania, ale mogą jeśli chcą redefiniować definicję stopowania i punktów przerywania programu.

source: This method checks if the *frame* is somewhere below :attr:`botframe` in the call stack. :attr:`botframe` is the frame in which debugging started.
pl: Ten sposób postępowania sprawdza czy *ramka* - z ang. - *frame* jest gdziekolwiek poniżej :attr:`botframe` na stercie wywołań. Właściwość :attr:`botframe` jest ramką od której odpluskwianie jest zaczynane.

source: This method checks if there is a breakpoint in the filename and line belonging to *frame* or, at least, in the current function. If the breakpoint is a temporary one, this method deletes it.
pl: Ten sposób postępowania sprawdza czy jest punkt przerywania wykonania programu w nazwie programu i linii należących do *ramki* lub przynajmniej obecnego zadania. Jeśli punkt przerywania jest tymczasowy, ten sposób postępowania kasuje go.
